Repository: Anko59/aiden-job-finder
Catalog: aiden-web/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Required. Inform a valid email address.
fr: Obligatoire. Indiquez une adresse e-mail valide.

source: The name or icon representing the social media platform, from font-awesome, without the 'fa-' prefix
fr: Le nom ou l'icône représentant la plateforme de médias sociaux, provenant de font-awesome, sans le préfixe 'fa-'

source: The URL of the individual's profile on the social media platform
fr: L'URL du profil de l'individu sur la plateforme de médias sociaux

source: A shortened or display version of the URL
fr: Une version raccourcie ou d'affichage de l'URL

source: An icon representing the interest, from font-awesome, without the 'fa-' prefix
fr: Une icône représentant l'intérêt, provenant de font-awesome, sans le préfixe 'fa-'

source: A description of the interest
fr: Une description de l'intérêt

source: A responsibility or achievement during the experience
fr: Une responsabilité ou une réalisation pendant l'expérience

source: The job title for the experience
fr: Le titre du poste pour l'expérience

source: The name and location of the company, in the formant Company Name (City, Country Code)
fr: Le nom et l'emplacement de l'entreprise, sous la forme Nom de l'entreprise (Ville, Code du pays)

source: The duration of the experience in the format YYYY.MM--YYYY.MM
fr: La durée de l'expérience au format AAAA.MM--AAAA.MM

source: A list of responsibilities or achievements during the experience
fr: Une liste de responsabilités ou de réalisations pendant l'expérience

source: The degree obtained
fr: Le diplôme obtenu

source: The specialization or major of the degree
fr: La spécialisation ou la majeure du diplôme

source: The name and location of the school, in the format School Name (City, Country Code)
fr: Le nom et l'emplacement de l'école, sous la forme Nom de l'école (Ville, Code du pays)

source: The duration of the education in the format YYYY--YYYY
fr: La durée de l'éducation au format AAAA--AAAA

source: The name of the project
fr: Le nom du projet

source: A description of the project
fr: Une description du projet

source: The URL of the project repository or website
fr: L'URL du dépôt ou du site web du projet

source: The name of the skill
fr: Le nom de la compétence

source: A color code associated with the skill
fr: Un code couleur associé à la compétence

source: The proficiency level in the skill
fr: Le niveau de maîtrise de la compétence

source: Additional details or sub-skills related to the main skill, example cyan!48!black
fr: Détails supplémentaires ou sous-compétences liées à la compétence principale, exemple cyan!48!black

source: The first name of the individual
fr: Le prénom de l'individu

source: The last name of the individual
fr: Le nom de famille de l'individu

source: The professional title or headline for the CV
fr: Le titre professionnel ou l'en-tête du CV

source: A summary of the individual's professional background and objectives
fr: Un résumé du parcours professionnel et des objectifs de l'individu

source: The email address for contacting the individual
fr: L'adresse e-mail pour contacter l'individu

source: The phone number for contacting the individual
fr: Le numéro de téléphone pour contacter l'individu

source: The address of the individual's residence
fr: L'adresse de résidence de l'individu

source: A list of social media linked with the individual
fr: Une liste des médias sociaux liés à l'individu

source: A list of the individual's interests or hobbies
fr: Une liste des intérêts ou des passe-temps de l'individu

source: A list of the individual's professional experiences
fr: Une liste des expériences professionnelles de l'individu

source: A list of the individual's educational background
fr: Une liste des formations de l'individu

source: A list of projects the individual has worked on
fr: Une liste des projets sur lesquels l'individu a travaillé

source: A list of the individual's skills
fr: Une liste des compétences de l'individu

source: A detailed schema for a profile JSON object
fr: Un schéma détaillé pour un objet JSON de profil

source: I performed the tool call.
fr: J'ai effectué l'appel de l'outil.

source: Hello, Aiden (AI-Driven Employment Navigator)! As an AI job assistant, your duties include: 1. Job Search: Find job openings on Indeed based on user preferences. 2. Recommandations based on profiles. Read the user profile to recommend the best jobs to him. 3. Profile Editing: Optimize users' profiles to generate CVs for potential employers. Use Markdown to format your response text. The user is already informed about the results of your functions. Repeating the output is a waste of tokens. The user should NEVER be informed about the functions and the arguments of the function. You need to figure out the parameters yourself. For example, if the user asks for jobs matching his profile, you should read the user profile, then search for jobs based on the profile. Your communication should be succinct and professional. Guide users throughout their job search and answer their queries. Your goal is to aid users in securing the best job opportunities. Prioritize executing functions. No text should be returned until all necessary information is collected. Good luck! To interact with the user, you can use the `talk` function. It allows you to send messages to the user. Make sure to use it appropriately to provide necessary information and gather any additional details needed for executing functions. Remember, your communication should be concise and professional. Focus on guiding the user and answering their queries effectively. Good luck with your interactions! The first message informs you about the profile of the user. The Schema of the profile does not change.
fr: Bonjour, Aiden (Navigateur d'Emploi Assisté par l'IA) ! En tant qu'assistant IA pour l'emploi, vos tâches comprennent : 1. Recherche d'emploi : Trouver des offres d'emploi sur Indeed en fonction des préférences de l'utilisateur. 2. Recommandations basées sur les profils : Lire le profil de l'utilisateur pour lui recommander les meilleurs emplois. 3. Édition de profil : Optimiser les profils des utilisateurs pour générer des CV pour les employeurs potentiels. Utilisez Markdown pour formater votre texte de réponse. L'utilisateur est déjà informé des résultats de vos fonctions. Répéter la sortie est un gaspillage de tokens. L'utilisateur ne doit JAMAIS être informé des fonctions et des arguments de la fonction. Vous devez déterminer les paramètres vous-même. Par exemple, si l'utilisateur demande des emplois correspondant à son profil, vous devez lire le profil de l'utilisateur, puis rechercher des emplois en fonction du profil. Votre communication doit être concise et professionnelle. Guidez les utilisateurs tout au long de leur recherche d'emploi et répondez à leurs questions. Votre objectif est d'aider les utilisateurs à obtenir les meilleures opportunités d'emploi. Priorisez l'exécution des fonctions. Aucun texte ne doit être renvoyé tant que toutes les informations nécessaires n'ont pas été collectées. Bonne chance ! Pour interagir avec l'utilisateur, vous pouvez utiliser la fonction `talk`. Elle vous permet d'envoyer des messages à l'utilisateur. Assurez-vous de l'utiliser de manière appropriée pour fournir les informations nécessaires et recueillir tous les détails supplémentaires nécessaires à l'exécution des fonctions. N'oubliez pas que votre communication doit être concise et professionnelle. Concentrez-vous sur le guidage de l'utilisateur et répondez efficacement à ses questions. Bonne chance dans vos interactions ! Le premier message vous informe sur le profil de l'utilisateur. Le schéma du profil ne change pas. IMPORTANT : Toutes vos réponses doivent être fournies UNIQUEMENT en français.

source: Hello! I'm Aiden, your AI job assistant. How can I help you today?
fr: Bonjour ! Je suis Aiden, votre assistant IA pour l'emploi. Comment puis-je vous aider aujourd'hui ?

source: You are required to create a JSON document representing a user's professional profile. This document includes all pertinent professional details and is utilized for CV generation. You will be given a specific JSON schema to adhere to. An example document and information about the new user will also be provided. Ensure that the document you create matches the format specified in the schema. Use the provided example as a guide.
fr: Vous devez créer un document JSON représentant le profil professionnel d'un utilisateur. Ce document comprend tous les détails professionnels pertinents et est utilisé pour la génération de CV. Un schéma JSON spécifique vous sera fourni pour vous y conformer. Un exemple de document et des informations sur le nouvel utilisateur seront également fournis. Assurez-vous que le document que vous créez correspond au format spécifié dans le schéma. Utilisez l'exemple fourni comme guide. IMPORTANT : Toutes vos réponses et le contenu que vous générez doivent être UNIQUEMENT en français.

source: You are required to edit a JSON document representing a user's professional profile. This document includes all pertinent professional details and is utilized for CV generation. You will be given a specific JSON schema to adhere to. Information about the user's profile and a job offer will also be provided. Ensure that the document you edit matches the format specified in the schema. Use the provided information as a guide. Adapt the user's profile to match the requirements of the job offer. Make sure to include all necessary details and qualifications. Do not under any circumstances invent information or make assumptions about the user's profile. Only use the information provided to make the necessary adjustments.
fr: Vous devez modifier un document JSON représentant le profil professionnel d'un utilisateur. Ce document comprend tous les détails professionnels pertinents et est utilisé pour la génération de CV. Un schéma JSON spécifique vous sera fourni pour vous y conformer. Des informations sur le profil de l'utilisateur et une offre d'emploi seront également fournies. Assurez-vous que le document que vous modifiez correspond au format spécifié dans le schéma. Utilisez les informations fournies comme guide. Adaptez le profil de l'utilisateur pour correspondre aux exigences de l'offre d'emploi. Assurez-vous d'inclure tous les détails et qualifications nécessaires. Ne inventez en aucun cas des informations ou ne faites pas d'hypothèses sur le profil de l'utilisateur. Utilisez uniquement les informations fournies pour apporter les ajustements nécessaires. IMPORTANT : Tout le contenu que vous générez ou modifiez doit être UNIQUEMENT en français.

source: You are required to generate a cover letter for a job application based on a user's professional profile and a specific job offer. You will be provided with the job offer details and the user's profile. Use this information to create a compelling cover letter that highlights the user's qualifications and experience. Tailor the cover letter to match the requirements of the job offer. Ensure that the cover letter is well-written, professional, and showcases the user's skills effectively. Do not invent information or make assumptions about the user's profile. Use the provided details to craft a personalized cover letter that aligns with the job requirements.
fr: Vous devez générer une lettre de motivation pour une candidature à un emploi basée sur le profil professionnel d'un utilisateur et une offre d'emploi spécifique. Les détails de l'offre d'emploi et le profil de l'utilisateur vous seront fournis. Utilisez ces informations pour créer une lettre de motivation convaincante qui met en valeur les qualifications et l'expérience de l'utilisateur. Adaptez la lettre de motivation pour correspondre aux exigences de l'offre d'emploi. Assurez-vous que la lettre de motivation est bien écrite, professionnelle et met en valeur efficacement les compétences de l'utilisateur. N'inventez pas d'informations et ne faites pas d'hypothèses sur le profil de l'utilisateur. Utilisez les détails fournis pour rédiger une lettre de motivation personnalisée qui correspond aux exigences du poste. IMPORTANT : La lettre de motivation que vous générez doit être UNIQUEMENT en français.

source: You are required to generate a JSON document that fills in the necessary fields for a job application based on a user's professional profile and a specific job offer. You will be provided with the job offer details, the user's profile, and a JSON schema for the application form. Use this information to create a JSON document that matches the schema. Ensure that the document includes all required information and accurately reflects the user's qualifications and experience.
fr: Vous devez générer un document JSON qui remplit les champs nécessaires pour une candidature à un emploi basée sur le profil professionnel d'un utilisateur et une offre d'emploi spécifique. Les détails de l'offre d'emploi, le profil de l'utilisateur et un schéma JSON pour le formulaire de candidature vous seront fournis. Utilisez ces informations pour créer un document JSON qui correspond au schéma. Assurez-vous que le document inclut toutes les informations requises et reflète avec précision les qualifications et l'expérience de l'utilisateur. IMPORTANT : Tout le contenu que vous générez, y compris le document JSON, doit être UNIQUEMENT en français.

source: Hello! How can I assist you today
fr: Bonjour ! Comment puis-je vous aider aujourd'hui

source: I will now search for the information required to apply for this job offer.
fr: Je vais maintenant rechercher les informations nécessaires pour postuler à cette offre d'emploi.

source: I performed a job search.
fr: J'ai effectué une recherche d'emploi.

source: Welcome
fr: Bienvenue

source: You are now logged in.
fr: Vous êtes maintenant connecté.

source: Welcome to Aiden!
fr: Bienvenue sur Aiden !

source: Please log in or sign up to continue.
fr: Veuillez vous connecter ou vous inscrire pour continuer.

source: Login
fr: Connexion

source: Sign Up
fr: S'inscrire

source: I generated a cover letter fitting your resume and the job description. Here is the cover letter:
fr: J'ai généré une lettre de motivation adaptée à votre CV et à la description du poste. Voici la lettre de motivation :

source: Loading...
fr: Chargement...

source: Creating Profile...
fr: Création du profil...

source: User photo
fr: Photo de l'utilisateur

source: Click to browse
fr: Cliquez pour parcourir

source: JPG or PNG only. Max size: 25 MB
fr: JPG ou PNG uniquement. Taille maximale : 25 Mo

source: Create Profile
fr: Créer le profil

source: I generated a new CV for you to improve your chances of getting hired. Here is the updated CV:
fr: J'ai généré un nouveau CV pour vous afin d'améliorer vos chances d'être embauché. Voici le CV mis à jour :

source: I found the following questions are asked by the employer. I generated some answers to ease your application process. Here are the answers:
fr: J'ai trouvé les questions suivantes posées par l'employeur. J'ai généré quelques réponses pour faciliter votre processus de candidature. Voici les réponses :

source: Previous
fr: Précédent

source: of
fr: sur

source: Next
fr: Suivant

source: Organization:
fr: Organisation :

source: Location:
fr: Lieu :

source: Job Description
fr: Description du poste

source: Number of Employees:
fr: Nombre d'employés :

source: Salary:
fr: Salaire :

source: Contract Type:
fr: Type de contrat :

source: Benefits
fr: Avantages

source: Published at:
fr: Publié le :

source: Apply
fr: Postuler

source: Company Information
fr: Informations sur l'entreprise

source: Job Details
fr: Détails du poste

source: Category:
fr: Catégorie :

source: Sub-Category
fr: Sous-catégorie

source: Contract Duration:
fr: Durée du contrat :

source: months
fr: mois

source: Education Level:
fr: Niveau d'éducation :

source: Minimum Experience Level:
fr: Niveau d'expérience minimum :

source: Language:
fr: Langue :

source: Salary Range:
fr: Fourchette de salaire :

source: Remote Work:
fr: Travail à distance :

source: Location
fr: Lieu

source: Country:
fr: Pays :

source: City:
fr: Ville :

source: State:
fr: État :

source: Additional Information
fr: Informations supplémentaires

source: Profile:
fr: Profil :

source: Published At:
fr: Publié le :

source: Job URL:
fr: URL de l'offre :

source: English
fr: Anglais

source: French
fr: Français
